// function Sum1(Arr, N) {
//   var len = Arr.length, sum = 0
//
//   for (var i = 0; i < 10; i++) {
//     if (Arr[i] > N) sum += Arr[i] * Arr[i]
//   }
//
//   return sum
// }
//
// alert(Sum1(2, 3))

// найти большой квадрат (БК)
// найти список квадратов-кнопок
// найти инпут
// найти кнопку добавления

// Повесить событие на кнопку добавления

// функция добавления
// достать value
// присвоить БК это value в background
// создать, окрасить, присвоить data-value, добавить классы кнопке
// вставить кнопку в список

// функция изменения цвета
// достать value из dataset
// перерисовать БК

